hybridMultiphaseFoamV7/tutorials/FreeFlowCases/Bretherton/porousBoundary/0/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   uniform 2e-20;

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    leftPorous
    {
        type            zeroGradient;
    }

    rightPorous
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    FrontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
