hybridMultiphaseFoamV7/tutorials/FreeFlowCases/Bretherton/porousBoundary/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32480
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftPorous
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            zeroGradient;
    }
    rightPorous
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
